# Module 1 - Pandas 1

### Introduction
We will introduce and discuss Python packages, specifically NumPy and Pandas, and use them
to read in data, process data, and create basic plots with matplotlib.

#### _Our goals today are to be able to_: <br/>

- Identify and import Python libraries
- Identify differences between NumPy and base Python in usage and operation
- Import/read data using Pandas
- Identify Pandas objects and manipulate Pandas objects by index and columns
- Filter data using Pandas

#### _Big questions for this lesson_: <br/>
- What is a package, what do packages do, and why might we want to use them?
- When do we want to use NumPy versus Pandas?
- What are the advantages of using Pandas?

### 1. Importing Python Libraries

Let's import some useful Python libraries.

To import a package type 'import' followed by the name of the library as shown below.

In [1]:
import numpy 

x = numpy.array([1,2,3])
print(x)

#most packages have a standard way to import them
import numpy as np

y=np.array([4,5,6])
print(y)

[1 2 3]
[4 5 6]

In [2]:
import scipy
import pandas as pd
import matplotlib as mpl

In [3]:
#sometimes we will want to import a specific module from a library
import matplotlib.pyplot as plt

plt.plot(x,y)

NameError: name 'x' is not defined

In [4]:
#OR we can also import it this way

from matplotlib import pyplot as plt 
plt.scatter(x,y)
plt.show()

NameError: name 'x' is not defined

Try importing the seaborn library as ['sns'](https://en.wikipedia.org/wiki/Sam_Seaborn) which is the convention.

In [5]:
import seaborn as sns
dir(sns)

['FacetGrid',
 'JointGrid',
 'PairGrid',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_orig_rc_params',
 'algorithms',
 'axes_style',
 'axisgrid',
 'barplot',
 'blend_palette',
 'boxenplot',
 'boxplot',
 'categorical',
 'catplot',
 'choose_colorbrewer_palette',
 'choose_cubehelix_palette',
 'choose_dark_palette',
 'choose_diverging_palette',
 'choose_light_palette',
 'clustermap',
 'cm',
 'color_palette',
 'colors',
 'countplot',
 'crayon_palette',
 'crayons',
 'cubehelix_palette',
 'dark_palette',
 'desaturate',
 'despine',
 'distplot',
 'distributions',
 'diverging_palette',
 'dogplot',
 'external',
 'factorplot',
 'get_dataset_names',
 'heatmap',
 'hls_palette',
 'husl_palette',
 'jointplot',
 'kdeplot',
 'light_palette',
 'lineplot',
 'lmplot',
 'load_dataset',
 'lvplot',
 'matrix',
 'miscplot',
 'mpl',
 'mpl_palette',
 'pairplot',
 'palettes',
 'palplot',
 'plotting_context',
 'pointplot',
 'rcmod',
 'regplot',
 'regression',
 'relational',
 'relplot',
 'reset_defaults',
 'reset_orig',
 'residplot',
 'rugplot',
 'saturate',
 'scatterplot',
 'set',
 'set_color_codes',
 'set_context',
 'set_hls_values',
 'set_palette',
 'set_style',
 'stripplot',
 'swarmplot',
 'timeseries',
 'tsplot',
 'utils',
 'violinplot',
 'widgets',
 'xkcd_palette',
 'xkcd_rgb']

What happens if we mess with naming conventions? For example, import one of our previous libraries as print.


PLEASE NOTE THAT WE WILL HAVE TO RESET THE KERNEL AFTER RUNNING THIS. Comment out your code after running it.

In [ ]:
#your code here!

In [ ]:
#Did we get an error? What about when we run the following command?

print(x)

#Restart your kernel and clear cells

#### Helpful links: library documenation

Libraries have associated documentation to explain how to use the different tools included in a library.

- [NumPy](https://docs.scipy.org/doc/numpy/)
- [SciPy](https://docs.scipy.org/doc/scipy/reference/)
- [Pandas](http://pandas.pydata.org/pandas-docs/stable/)
- [Matplotlib](https://matplotlib.org/contents.html)

### 2. NumPy versus base Python

Now that we know libraries exist, why do we want to use them? Let us examine a comparison between base Python and Numpy.

Python has lists and normal python can do basic math. NumPy, however, has the helpful objects called arrays.

Numpy has a few advantages over base Python which we will look at.

In [11]:
names_list=['Bob','John','Sally']
names_array=numpy.char.array(['Bob','John','Sally']) #use numpy.array for numbers and numpy.char.array for strings
print(names_list)
print(names_array)

['Bob', 'John', 'Sally']
['Bob' 'John' 'Sally']

In [14]:
# Make a list and an array of three numbers
import math

#your code here
numbers_list = [math.e, math.pi, math.tau]
numbers_array = np.array(numbers_list)
numbers_array

array([2.71828183, 3.14159265, 6.28318531])

In [15]:
# divide your array by 2

numbers_array/2

array([1.35914091, 1.57079633, 3.14159265])

In [16]:
# divide your list by 2

numbers_list/2

TypeError: unsupported operand type(s) for /: 'list' and 'int'

Numpy arrays support the \_div\_ operator while python lists do not. There are other things that make it useful to utilize numpy over base python for evaluating data.

Below, you will find a piece of code we will use to compare the speed of operations on a list and operations on an array. In this speed test, we will use the library [time](https://docs.python.org/3/library/time.html).

In [17]:
import time
import numpy as np

size_of_vec = 1000

def pure_python_version():
    t1 = time.time()
    X = range(size_of_vec)
    Y = range(size_of_vec)
    Z = [X[i] + Y[i] for i in range(len(X)) ]
    return time.time() - t1

def numpy_version():
    t1 = time.time()
    X = np.arange(size_of_vec)
    Y = np.arange(size_of_vec)
    Z = X + Y
    return time.time() - t1


t1 = pure_python_version()
t2 = numpy_version()
print("python: " + str(t1), "numpy: "+ str(t2))
print("Numpy is in this example " + str(t1/t2) + " times faster!")

python: 0.0005598068237304688 numpy: 6.413459777832031e-05
Numpy is in this example 8.728624535315985 times faster!

In pairs, run the speed test with a different number, and share your results with the class.

### 3. Importing and reading data with ACTUAL LITERAL Pandas!
![alt text](https://cdn-images-1.medium.com/max/1600/1*oBx032ncOwLmCFX3Epo3Zg.jpeg "https://cdn-images-1.medium.com/max/1600/1*oBx032ncOwLmCFX3Epo3Zg.jpeg")

#### Let's use pandas to read some csv files so we can interact with them.

In [18]:
import pandas as pd

example_csv=pd.read_csv('example1.csv')

In [19]:
example_csv.head() #this is an example template of how to create a csv

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

Try loading in the example file in the directory called 'made_up_jobs.csv' using pandas.

In [22]:
#read in your csv here!
made_up_jobs = pd.read_csv('made_up_jobs.csv')
made_up_jobs

#remember that it's nice to be able to look at your data, so let's do that here, too.

   ID            Name                       Job  Years Employed
0   0    Bob Bobberty  Underwater Basket Weaver              13
1   1    Susan Smells             Salad Spinner               5
2   2   Alex Lastname      Productivity Manager               2
3   3         Rudy P.                Being cool              55
4   4         Rudy G.  Being compared to Rudy P              50
5   5  Sir Wellington            Cheese Stacker              10

You can also load in data by using the url of an associated dataset.

In [23]:
shelter_data=pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD') 
#this link is copied directly from the download option for CSV

In [24]:
shelter_data.head().T

,0,1,2,3,4
Animal ID,A791086,A790751,A791924,A790605,A791540
Name,NaN,*Pixie,NaN,NaN,*Milkbone
DateTime,04/03/2019 03:55:00 PM,04/03/2019 03:41:00 PM,04/03/2019 03:05:00 PM,04/03/2019 02:51:00 PM,04/03/2019 02:29:00 PM
MonthYear,04/03/2019 03:55:00 PM,04/03/2019 03:41:00 PM,04/03/2019 03:05:00 PM,04/03/2019 02:51:00 PM,04/03/2019 02:29:00 PM
Date of Birth,03/21/2018,03/16/2018,04/03/2018,03/12/2019,03/27/2018
Outcome Type,Adoption,Return to Owner,Euthanasia,Died,Transfer
Outcome Subtype,NaN,NaN,Rabies Risk,In Foster,Partner
Animal Type,Dog,Dog,Other,Dog,Dog
Sex upon Outcome,Spayed Female,Spayed Female,Unknown,Intact Female,Spayed Female
Age upon Outcome,1 year,1 year,1 year,3 weeks,1 year
Breed,Pointer/Beagle,Pit Bull Mix,Bat Mix,Australian Shepherd Mix,Pit Bull Mix
Color,Black/White,Brown Brindle/White,Brown,Brown/White,White/Black

Now that we can read in data, let's get more comfortable with our Pandas data structures.

In [25]:
type(shelter_data)

pandas.core.frame.DataFrame

In [26]:
ID_series=shelter_data['Animal ID'] #you can specify particular columns in a data frame in this way.

type(ID_series)

pandas.core.series.Series

### 4. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists and dictionary objects?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [30]:
sorted([5,4,3,2,1])

[1, 2, 3, 4, 5]

In [31]:
#define your list here!

fruits = ['Apple','Orange','Watermelon','Lemon','Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [32]:
fruits_series = pd.Series(fruits)

print(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

One difference between python list objects and pandas series objects is the fact that you can define the index manually.

In [34]:
ind = ['a','b','c','d','e']

fruits_series = pd.Series(fruits, index=ind)

display(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [46]:
list_of_lists=[['cat'],['dog'],['horse'],['cow'],['macaw']]
list_of_strings = [x[0] for x in list_of_lists]

list_of_lists

ind = ['Bob','Suzy','Mytili','Hector',"Hector's Brother"]
pd.Series(list_of_strings, index = ind)
#create custom indices for your series

#create the series using your list objects
#HINT: use a for loop


#print your series

Bob                   cat
Suzy                  dog
Mytili              horse
Hector                cow
Hector's Brother    macaw
dtype: object

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [27]:
# Dictionary with list object in values
student_dict = {
    'name' : ['Samantha', 'Alex', 'Dante'],
    'age' : ['35','17','26'],
    'city' : ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [48]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

Let's change the data type of ages to int.

In [33]:
students_df.age = students_df.age.astype(int)

students_df.dtypes

name    object
age      int64
city    object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [34]:
school_ids = ['1111','1145','0096']

students_df = pd.DataFrame(student_dict,index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [35]:
students_df.columns = ['NAME', 'AGE','HOME']
students_df.head()

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [36]:
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [37]:
students_df.drop(columns=['YEARS', 'HOME'])

          NAME
1111  Samantha
1145      Alex
0096     Dante

In [38]:
students_df.drop(index=['1111']) #unintuitively, this is a string!

       NAME YEARS      HOME
1145   Alex    17   Seattle
0096  Dante    26  New york

Adding columns can be a bit trickier, however.

#### Getting Started

Let's define a function that returns a dataframe for us to work with. Note that this dataframe is created from a `list` of dictionaries, and each `dict` has identical _keys_ representing field names. The _values_ are the data to be stored in each field.

This list-of-dictionaries format is a common way to represent _rows of data_ in Python.

Pandas is not the only tool that supports it natively: **MongoDB** also represents each row of a dataset as a dictionary. This format is also useful when working with big data in Spark.

In [3]:
def get_customer_data():
    """Return a Pandas DataFrame containing imaginary customer data."""
    customers = [
        {'name': 'Harmony', 'state': 'OR'},
        {'name': 'Sarah', 'state': 'CA'},
        {'name': 'Sharad', 'state': 'WA'},
        {'name': 'CJ', 'state': 'NY'},
        {'name': 'Jerry', 'state': 'OR'},
    ]
    return pd.DataFrame(customers)

In [4]:
get_customer_data()

      name state
0  Harmony    OR
1    Sarah    CA
2   Sharad    WA
3       CJ    NY
4    Jerry    OR

#### Get the customer data

In [5]:
customer_df = get_customer_data()
customer_df

      name state
0  Harmony    OR
1    Sarah    CA
2   Sharad    WA
3       CJ    NY
4    Jerry    OR

#### Try to identify all Oregonian customers as hippies:

In [6]:
oregon_customer_df = customer_df[customer_df['state'] == 'OR']
oregon_customer_df['is_hippy'] = 1
oregon_customer_df

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

      name state  is_hippy
0  Harmony    OR         1
4    Jerry    OR         1

In [76]:
oregon_customer_df = customer_df[customer_df['state'] == 'OR']
oregon_customer_df.loc[:,'is_hippy'] = 1
oregon_customer_df

      name state  is_hippy
0  Harmony    OR         1
4    Jerry    OR         1

#### Try to identify all non-Oregonian customers as non-hippies:

In [80]:
non_oregon_customer_df = customer_df.loc[:,'state'] != 'OR'
non_oregon_customer_df.loc[:,'is_hippy'] = 0
non_oregon_customer_df

IndexingError: (slice(None, None, None), 'is_hippy')

#### We can do the same thing on a single line (and get the same warning):

In [7]:
customer_df[customer_df['state'] == 'OR']['is_hippy'] = 1

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

#### See the results! (What's wrong?)

In [84]:
customer_df

      name state
0  Harmony    OR
1    Sarah    CA
2   Sharad    WA
3       CJ    NY
4    Jerry    OR

#### What went wrong?

1. First, we _sliced_ the original dataframe to include just Oregon customers.
2. The _slice_ `oregon_customer_df` could be interpreted as a _new dataframe_ containing the selected rows in the original `customer_df`, or as a _pointer to_ the rows in the original dataframe. Pandas doesn't know which one we want.
3. When we try to _modify_ or _set_ values in the slice, Pandas doesn't know what to do.

#### One way to avoid the error is to explicitly make a copy of the slice with `df.copy()`:

In [8]:
oregon_customer_df = customer_df[customer_df['state'] == 'OR'].copy()
oregon_customer_df['is_hippy'] = 1
oregon_customer_df

      name state  is_hippy
0  Harmony    OR         1
4    Jerry    OR         1

#### What if we really want to modify the original dataframe?
#### We can use `df.loc[columns, rows]` to explicity modify the original dataframe.

In [11]:
customer_df.loc[customer_df['state'] == 'OR', 'is_hippy'] = 1
customer_df.loc[customer_df['state'] != 'OR', 'is_hippy'] = 0

#### See the awesome results!

In [12]:
customer_df

      name state  is_hippy
0  Harmony    OR       1.0
1    Sarah    CA       0.0
2   Sharad    WA       0.0
3       CJ    NY       0.0
4    Jerry    OR       1.0

### 5. Filtering data using Pandas

There are several ways to grab particular data from a DataFrame.

We saw the use of loc in the previous example. iloc and loc can be used in a few different ways to access data from a DataFrame.

In [13]:
[] == []

True

In [14]:
[] is []

False

In [15]:
customer_df.iloc[0] #returns the first row

name        Harmony
state            OR
is_hippy          1
Name: 0, dtype: object

In [16]:
customer_df.iloc[:,0] #returns the first column

0    Harmony
1      Sarah
2     Sharad
3         CJ
4      Jerry
Name: name, dtype: object

In [17]:
customer_df.iloc[0:2] #returns first two rows

      name state  is_hippy
0  Harmony    OR       1.0
1    Sarah    CA       0.0

In [18]:
customer_df.iloc[:,0:2] #returns the first two columns

      name state
0  Harmony    OR
1    Sarah    CA
2   Sharad    WA
3       CJ    NY
4    Jerry    OR

In [ ]:
df.loc[rowstart : rowstop , colstart : colstop]

How would we use indexing to return the last item in the last row?

In [25]:
#return the last item in the last row using indexing
display(customer_df.iloc[-1:,-1:])
customer_df.iloc[-1,-1]

   is_hippy
4       1.0

1.0

Use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.

In [28]:
students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [39]:
students_df.loc['1111'] #returns the student information associated with the ID number 1111, which is the index

NAME     Samantha
YEARS          35
HOME      Houston
Name: 1111, dtype: object

In [40]:
students_df.loc[:,'YEARS'] #returns the column labeled 'YEARS'

1111    35
1145    17
0096    26
Name: YEARS, dtype: object

In [41]:
students_df.loc['1111','NAME':'HOME'] #returns information for the row labeled '1111' for columns from 'NAME' to 'HOME'

NAME     Samantha
YEARS          35
HOME      Houston
Name: 1111, dtype: object

How could we return the first and last rows if loc accepts a list of labels?

In [43]:
students_df

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [45]:
#return the first and last rows using one loc command

students_df.loc[['1111','0096']]

          NAME YEARS      HOME
1111  Samantha    35   Houston
0096     Dante    26  New york

We can use loc to complete more complicated filtering of our data using boolean indexing.

In [46]:
students_df.loc[students_df['NAME']=='Samantha'] #returns only rows where the name of the student is Samantha

          NAME YEARS     HOME
1111  Samantha    35  Houston

We can also find out which customers in the customer_df DataFrame are not from Oregon. However, I only want to know their names. How would I return this?

In [47]:
customer_df.head()

      name state  is_hippy
0  Harmony    OR       1.0
1    Sarah    CA       0.0
2   Sharad    WA       0.0
3       CJ    NY       0.0
4    Jerry    OR       1.0

In [49]:
#return the names of customers who are not from Oregon
customer_df['name'].loc[customer_df['state'] != 'OR']

1     Sarah
2    Sharad
3        CJ
Name: name, dtype: object

Let's select only a single column from a DataFrame. This will create a series, which allows for straightforwards, simple selection of the data it holds.

In [50]:
states=customer_df.loc[:,'state'] #returns a series!!
type(states)

pandas.core.series.Series

In [51]:
states[0:3] #returns the first 3 items

0    OR
1    CA
2    WA
Name: state, dtype: object

In [53]:
states[states=='OR'] #returns 'OR' data and index

0    OR
4    OR
Name: state, dtype: object

Now that we know how to select specific data, we can manipulate those cells. For example, we need to update our customer data because all of our customers in Oregon have moved to New Jersey.

In [54]:
customer_df.loc[customer_df["state"]=='OR', "state"] = 'NJ'

customer_df

      name state  is_hippy
0  Harmony    NJ       1.0
1    Sarah    CA       0.0
2   Sharad    WA       0.0
3       CJ    NY       0.0
4    Jerry    NJ       1.0

Or maybe we got a customer's name wrong and need to change that. Perhaps CJ is actually named TJ. How would we do that?

In [58]:
#return a the customer_df with the fixed name
customer_df.loc[customer_df['name']=='CJ', 'name'] = 'TJ'
customer_df.loc[customer_df['name']=='TJ', 'name']

3    TJ
Name: name, dtype: object

### Lesson Recap